In [1]:
import numpy as np
import pandas as pd

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer #for_missing Data
from sklearn.preprocessing import OneHotEncoder,LabelEncoder,OrdinalEncoder,MinMaxScaler
from sklearn.tree import DecisionTreeClassifier

In [2]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.shape

(891, 12)

In [4]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
df.drop(columns=['PassengerId','Name','Ticket','Cabin' ], inplace = True)

In [6]:
df.head(2)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C

In [7]:
X_train,X_test,y_train,y_test = train_test_split(df.drop(columns=['Survived']),
                                                 df['Survived'],
                                                 test_size=0.2,
                                                 random_state=42)

In [8]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [9]:
X_train.head(2)

     Pclass   Sex   Age  SibSp  Parch  Fare Embarked
331       1  male  45.5      0      0  28.5        S
733       2  male  23.0      0      0  13.0        S

In [10]:
si_age = SimpleImputer()
si_embarked = SimpleImputer(strategy="most_frequent")

In [11]:
X_train_age = si_age.fit_transform(X_train[['Age']])
X_train_embarked = si_embarked.fit_transform(X_train[['Embarked']])

X_test_age = si_age.transform(X_test[['Age']])
X_test_embarked = si_embarked.transform(X_test[['Embarked']])

In [12]:
X_train.head(2)

     Pclass   Sex   Age  SibSp  Parch  Fare Embarked
331       1  male  45.5      0      0  28.5        S
733       2  male  23.0      0      0  13.0        S

In [13]:
# Encoding categorical variables 

ohe_sex = OneHotEncoder(sparse=False,handle_unknown='ignore')
ohe_embarked = OneHotEncoder(sparse=False,handle_unknown='ignore')

In [14]:
X_train_sex = ohe_sex.fit_transform(X_train[['Sex']])
X_train_embarked = ohe_embarked.fit_transform(X_train[['Embarked']])

X_test_sex = ohe_sex.transform(X_test[['Sex']])
X_test_embarked = ohe_embarked.transform(X_test[['Embarked']])

In [15]:
X_train_embarked

array([[0., 0., 1., 0.],
       [0., 0., 1., 0.],
       [0., 0., 1., 0.],
       ...,
       [0., 0., 1., 0.],
       [0., 0., 1., 0.],
       [0., 0., 1., 0.]])

In [16]:
X_train_rem = X_train.drop(columns=['Sex','Age','Embarked'])
X_test_rem = X_test.drop(columns=['Sex','Age','Embarked'])

In [17]:
X_train_transformed = np.concatenate((X_train_rem,X_train_age,X_train_sex,X_train_embarked),axis=1)
X_test_transformed = np.concatenate((X_test_rem,X_test_age,X_test_sex,X_test_embarked),axis=1)

In [18]:
pd.DataFrame(X_train_transformed).sample(5)

      0    1    2       3          4    5    6    7    8    9    10
178  2.0  0.0  0.0  10.500  62.000000  0.0  1.0  0.0  0.0  1.0  0.0
314  3.0  0.0  0.0   7.775  29.498846  0.0  1.0  0.0  0.0  1.0  0.0
313  3.0  0.0  0.0   7.925  31.000000  0.0  1.0  0.0  0.0  1.0  0.0
207  2.0  0.0  0.0  13.000  30.000000  0.0  1.0  0.0  0.0  1.0  0.0
562  2.0  0.0  0.0  26.000  46.000000  0.0  1.0  0.0  0.0  1.0  0.0

In [19]:
X_train_transformed.shape

(712, 11)

In [20]:
pd.DataFrame(X_train_transformed)

      0    1    2         3          4    5    6    7    8    9    10
0    1.0  0.0  0.0   28.5000  45.500000  0.0  1.0  0.0  0.0  1.0  0.0
1    2.0  0.0  0.0   13.0000  23.000000  0.0  1.0  0.0  0.0  1.0  0.0
2    3.0  0.0  0.0    7.9250  32.000000  0.0  1.0  0.0  0.0  1.0  0.0
3    3.0  1.0  0.0    7.8542  26.000000  0.0  1.0  0.0  0.0  1.0  0.0
4    3.0  4.0  2.0   31.2750   6.000000  1.0  0.0  0.0  0.0  1.0  0.0
..   ...  ...  ...       ...        ...  ...  ...  ...  ...  ...  ...
707  3.0  0.0  0.0    7.6500  21.000000  1.0  0.0  0.0  0.0  1.0  0.0
708  1.0  0.0  0.0   31.0000  29.498846  0.0  1.0  0.0  0.0  1.0  0.0
709  3.0  2.0  0.0   14.1083  41.000000  0.0  1.0  0.0  0.0  1.0  0.0
710  1.0  1.0  2.0  120.0000  14.000000  1.0  0.0  0.0  0.0  1.0  0.0
711  1.0  0.0  1.0   77.2875  21.000000  0.0  1.0  0.0  0.0  1.0  0.0

[712 rows x 11 columns]

In [21]:
X_test_transformed.shape

(179, 11)

In [22]:
clf = DecisionTreeClassifier()
clf.fit(X_train_transformed,y_train)

DecisionTreeClassifier()

In [23]:
y_pred = clf.predict(X_test_transformed)

In [24]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test,y_pred)

0.7821229050279329